---
type: ElementStructuralTypeFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementStructuralTypeFilter

`Autodesk.Revit.DB.ElementStructuralTypeFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementStructuralTypeFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | StructuralType | 2011 | `public StructuralType StructuralType { get ; }` |